import { createSlice } from "@reduxjs/toolkit";
import { readAllCities } from "./cities.operations";

const initialState = {
  citiesTotalAmount: 0,
  cityArr: [],
};

export const citiesSlice = createSlice({
  name: "cities",
  initialState,
  reducers: {},
  extraReducers: (builder) => {
    builder
      .addCase(readAllCities.pending, (state) => {
        state.isRefreshing = true;
      })
      .addCase(readAllCities.fulfilled, (state, action) => {
        state.cityArr = action.payload.data;
        state.citiesTotalAmount = action.payload.meta.total;
        state.isAuthorize = true;
        state.isRefreshing = false;
      })
      .addCase(readAllCities.rejected, (state) => {
        state.isRefreshing = false;
      });
  },
});

// export const {} = authSlice.actions;

export const citiesReducer = citiesSlice.reducer;

// const exampleImg =
//   "https://rare-gallery.com/uploads/posts/958459-landscape-nature-river-sunlight-clouds-mountains.jpg";
// {
//   id: "1",
//   name: "Осло",
//   shortDesc: "Столиця та найбільше місто Норвегії.",
//   images: [
//     {
//       url: "https://rare-gallery.com/uploads/posts/958459-landscape-nature-river-sunlight-clouds-mountains.jpg",
//       description: "Панорама Осло.",
//     },
//     {
//       url: exampleImg,
//       description: "Королівський палац в Осло.",
//     },
//   ],
//   sections: [
//     {
//       title: "Історія",
//       content: `
//           Осло було засноване в 1040 році та стало столицею Норвегії в 1299 році. Місто пройшло через багато випробувань, включаючи кілька значних пожеж, які знищили велику частину середньовічної забудови. Після великої пожежі в 1624 році король Крістіан IV вирішив перебудувати місто під назвою Крістіанія. Тільки в 1925 році місто повернуло своє історичне ім'я Осло. Сьогодні Осло є важливим культурним і економічним центром країни. Завдяки своєму розташуванню на узбережжі фіорду Осло та оточенню лісами, місто пропонує унікальне поєднання природної краси та міського життя. Осло є домом для багатьох історичних пам'яток, таких як замок Акерсгус, який був побудований у 13 столітті, і є одним із найважливіших середньовічних замків у Норвегії. Місто також відіграло ключову роль у розвитку норвезької морської торгівлі та культури.
//         `,
//       images: [exampleImg, exampleImg, exampleImg],
//     },
//     {
//       title: "Культура",
//       content: `
//           Осло відоме своїми музеями, театрами та культурними заходами. Місто має багату культурну спадщину, яку можна побачити в численних музеях, таких як Музей Мунка, Національна галерея та Норвезький фольклорний музей. Осло також є домом для Нобелівського центру миру, де щорічно вручається Нобелівська премія миру. У місті проходять різні музичні та театральні фестивалі, включаючи відомий фестиваль музики Осло. Місто пишається своєю живою музичною сценою, де можна почути як класичну, так і сучасну музику. Осло також відоме своїми архітектурними шедеврами, такими як будівля Оперного театру, яка є символом сучасної архітектури. Вулиці міста наповнені вуличним мистецтвом і скульптурами, що додає особливого шарму його культурному ландшафту.
//         `,
//       images: [exampleImg, exampleImg, exampleImg, exampleImg],
//     },
//   ],
// },
// {
//   id: "2",
//   name: "Берген",
//   shortDesc: "Другий за величиною місто Норвегії, відоме своїми фіордами.",
//   images: [
//     {
//       url: exampleImg,
//       description: "Вид на Берген з гори Фльоєн.",
//     },
//     {
//       url: exampleImg,
//       description: "Історичний район Брюгген.",
//     },
//   ],
//   sections: [
//     {
//       title: "Історія",
//       content: `
//           Берген був заснований у 1070 році та є важливим портовим містом. Місто швидко стало одним із найважливіших центрів торгівлі в Північній Європі завдяки своїй стратегічній розташованості. Берген був важливою частиною Ганзейського союзу, що сприяло його процвітанню. Сьогодні Берген зберігає своє історичне значення та є важливим культурним центром, відомим своїми старовинними дерев'яними будівлями в районі Брюгген, які включені до списку Світової спадщини ЮНЕСКО. Берген також відіграв значну роль у розвитку норвезької музичної та театральної традицій. Місто відоме своїми старовинними церквами, такими як собор Святого Олафа, та іншими архітектурними пам'ятками, які відображають його багату історію. Берген також був домом для відомих норвезьких діячів культури, таких як композитор Едвард Гріг.
//         `,
//       images: [exampleImg, exampleImg],
//     },
//     {
//       title: "Природа",
//       content: `
//           Берген оточений фіордами та горами, що робить його популярним серед туристів. Місто є воротами до знаменитих норвезьких фіордів, включаючи найвідоміший - Согнефіорд. Туристи можуть насолоджуватися мальовничими краєвидами, піші прогулянки в горах та екскурсії на човнах по фіордах. Берген також відомий своїми численними парками та зеленими зонами, які роблять його ідеальним місцем для відпочинку на природі. Окрім природних красот, Берген пропонує відвідувачам можливість дослідити багату морську спадщину міста через відвідування морських музеїв та акваріуму Бергена. Завдяки своєму унікальному розташуванню, Берген пропонує ідеальне поєднання міського життя та природної краси, що робить його незабутнім місцем для відвідування.
//         `,
//       images: [exampleImg, exampleImg],
//     },
//   ],
// },
// {
//   id: "3",
//   name: "Тронгейм",
//   shortDesc: "Історичне місто та колишня столиця Норвегії.",
//   images: [
//     {
//       url: "https://rare-gallery.com/uploads/posts/958459-landscape-nature-river-sunlight-clouds-mountains.jpg",
//       description: "Вид на Тронгейм та собор Нідарос.",
//     },
//     {
//       url: "https://example.com/trondheim2.jpg",
//       description: "Річка Нідельва, що протікає через місто.",
//     },
//   ],
//   sections: [
//     {
//       title: "Історія",
//       content: `
//           Осло було засноване в 1040 році та стало столицею Норвегії в 1299 році. Місто пройшло через багато випробувань, включаючи кілька значних пожеж, які знищили велику частину середньовічної забудови. Після великої пожежі в 1624 році король Крістіан IV вирішив перебудувати місто під назвою Крістіанія. Тільки в 1925 році місто повернуло своє історичне ім'я Осло. Сьогодні Осло є важливим культурним і економічним центром країни. Завдяки своєму розташуванню на узбережжі фіорду Осло та оточенню лісами, місто пропонує унікальне поєднання природної краси та міського життя. Осло є домом для багатьох історичних пам'яток, таких як замок Акерсгус, який був побудований у 13 столітті, і є одним із найважливіших середньовічних замків у Норвегії. Місто також відіграло ключову роль у розвитку норвезької морської торгівлі та культури.
//         `,
//       images: [exampleImg, exampleImg, exampleImg],
//     },
//     {
//       title: "Культура",
//       content: `
//           Осло відоме своїми музеями, театрами та культурними заходами. Місто має багату культурну спадщину, яку можна побачити в численних музеях, таких як Музей Мунка, Національна галерея та Норвезький фольклорний музей. Осло також є домом для Нобелівського центру миру, де щорічно вручається Нобелівська премія миру. У місті проходять різні музичні та театральні фестивалі, включаючи відомий фестиваль музики Осло. Місто пишається своєю живою музичною сценою, де можна почути як класичну, так і сучасну музику. Осло також відоме своїми архітектурними шедеврами, такими як будівля Оперного театру, яка є символом сучасної архітектури. Вулиці міста наповнені вуличним мистецтвом і скульптурами, що додає особливого шарму його культурному ландшафту.
//         `,
//       images: [exampleImg, exampleImg, exampleImg, exampleImg],
//     },
//   ],
// },
// {
//   id: "4",
//   name: "Ставангер",
//   shortDesc:
//     "Місто на південному заході Норвегії, відоме своїми нафтовими компаніями.",
//   images: [
//     {
//       url: "https://rare-gallery.com/uploads/posts/958459-landscape-nature-river-sunlight-clouds-mountains.jpg",
//       description: "Центр Ставангера.",
//     },
//     {
//       url: "https://example.com/stavanger2.jpg",
//       description: "Старий місто Ставангера.",
//     },
//   ],
//   sections: [
//     {
//       title: "Історія",
//       content: `
//           Осло було засноване в 1040 році та стало столицею Норвегії в 1299 році. Місто пройшло через багато випробувань, включаючи кілька значних пожеж, які знищили велику частину середньовічної забудови. Після великої пожежі в 1624 році король Крістіан IV вирішив перебудувати місто під назвою Крістіанія. Тільки в 1925 році місто повернуло своє історичне ім'я Осло. Сьогодні Осло є важливим культурним і економічним центром країни. Завдяки своєму розташуванню на узбережжі фіорду Осло та оточенню лісами, місто пропонує унікальне поєднання природної краси та міського життя. Осло є домом для багатьох історичних пам'яток, таких як замок Акерсгус, який був побудований у 13 столітті, і є одним із найважливіших середньовічних замків у Норвегії. Місто також відіграло ключову роль у розвитку норвезької морської торгівлі та культури.
//         `,
//       images: [exampleImg, exampleImg, exampleImg],
//     },
//     {
//       title: "Культура",
//       content: `
//           Осло відоме своїми музеями, театрами та культурними заходами. Місто має багату культурну спадщину, яку можна побачити в численних музеях, таких як Музей Мунка, Національна галерея та Норвезький фольклорний музей. Осло також є домом для Нобелівського центру миру, де щорічно вручається Нобелівська премія миру. У місті проходять різні музичні та театральні фестивалі, включаючи відомий фестиваль музики Осло. Місто пишається своєю живою музичною сценою, де можна почути як класичну, так і сучасну музику. Осло також відоме своїми архітектурними шедеврами, такими як будівля Оперного театру, яка є символом сучасної архітектури. Вулиці міста наповнені вуличним мистецтвом і скульптурами, що додає особливого шарму його культурному ландшафту.
//         `,
//       images: [exampleImg, exampleImg, exampleImg, exampleImg],
//     },
//   ],
// },
// {
//   id: "5",
//   name: "Тромсе",
//   shortDesc: "Місто за Полярним колом, відоме своїми північними сяйвами.",
//   images: [
//     {
//       url: "https://rare-gallery.com/uploads/posts/958459-landscape-nature-river-sunlight-clouds-mountains.jpg",
//       description: "Панорама Тромсе взимку.",
//     },
//     {
//       url: "https://example.com/tromso2.jpg",
//       description: "Полярне сяйво над Тромсе.",
//     },
//   ],
//   sections: [
//     {
//       title: "Історія",
//       content: `
//           Осло було засноване в 1040 році та стало столицею Норвегії в 1299 році. Місто пройшло через багато випробувань, включаючи кілька значних пожеж, які знищили велику частину середньовічної забудови. Після великої пожежі в 1624 році король Крістіан IV вирішив перебудувати місто під назвою Крістіанія. Тільки в 1925 році місто повернуло своє історичне ім'я Осло. Сьогодні Осло є важливим культурним і економічним центром країни. Завдяки своєму розташуванню на узбережжі фіорду Осло та оточенню лісами, місто пропонує унікальне поєднання природної краси та міського життя. Осло є домом для багатьох історичних пам'яток, таких як замок Акерсгус, який був побудований у 13 столітті, і є одним із найважливіших середньовічних замків у Норвегії. Місто також відіграло ключову роль у розвитку норвезької морської торгівлі та культури.
//         `,
//       images: [exampleImg, exampleImg, exampleImg],
//     },
//     {
//       title: "Культура",
//       content: `
//           Осло відоме своїми музеями, театрами та культурними заходами. Місто має багату культурну спадщину, яку можна побачити в численних музеях, таких як Музей Мунка, Національна галерея та Норвезький фольклорний музей. Осло також є домом для Нобелівського центру миру, де щорічно вручається Нобелівська премія миру. У місті проходять різні музичні та театральні фестивалі, включаючи відомий фестиваль музики Осло. Місто пишається своєю живою музичною сценою, де можна почути як класичну, так і сучасну музику. Осло також відоме своїми архітектурними шедеврами, такими як будівля Оперного театру, яка є символом сучасної архітектури. Вулиці міста наповнені вуличним мистецтвом і скульптурами, що додає особливого шарму його культурному ландшафту.
//         `,
//       images: [exampleImg, exampleImg, exampleImg, exampleImg],
//     },
//   ],
// },
