import { createSlice } from "@reduxjs/toolkit";
const exampleImg =
  "https://scandification.com/wp-content/uploads/2019/07/History-of-Norway-1-scaled.jpg";
const initialState = {
  landmarksTotalAmount: 5,
  landmarkArr: [
    {
      id: "1",
      name: "Гейрангер-фіорд",
      shortDesc:
        "Один з найвідоміших фіордів Норвегії, включений до списку всесвітньої спадщини ЮНЕСКО.",
      images: [
        {
          url: exampleImg,
          description: "Вид на Гейрангер-фіорд.",
        },
        {
          url: exampleImg,
          description: "Круїзний корабель у Гейрангер-фіорді.",
        },
      ],
      sections: [
        {
          title: "Історія",
          content: `
              Осло було засноване в 1040 році та стало столицею Норвегії в 1299 році. Місто пройшло через багато випробувань, включаючи кілька значних пожеж, які знищили велику частину середньовічної забудови. Після великої пожежі в 1624 році король Крістіан IV вирішив перебудувати місто під назвою Крістіанія. Тільки в 1925 році місто повернуло своє історичне ім'я Осло. Сьогодні Осло є важливим культурним і економічним центром країни. Завдяки своєму розташуванню на узбережжі фіорду Осло та оточенню лісами, місто пропонує унікальне поєднання природної краси та міського життя. Осло є домом для багатьох історичних пам'яток, таких як замок Акерсгус, який був побудований у 13 столітті, і є одним із найважливіших середньовічних замків у Норвегії. Місто також відіграло ключову роль у розвитку норвезької морської торгівлі та культури.
            `,
          images: [exampleImg, exampleImg, exampleImg],
        },
        {
          title: "Культура",
          content: `
              Осло відоме своїми музеями, театрами та культурними заходами. Місто має багату культурну спадщину, яку можна побачити в численних музеях, таких як Музей Мунка, Національна галерея та Норвезький фольклорний музей. Осло також є домом для Нобелівського центру миру, де щорічно вручається Нобелівська премія миру. У місті проходять різні музичні та театральні фестивалі, включаючи відомий фестиваль музики Осло. Місто пишається своєю живою музичною сценою, де можна почути як класичну, так і сучасну музику. Осло також відоме своїми архітектурними шедеврами, такими як будівля Оперного театру, яка є символом сучасної архітектури. Вулиці міста наповнені вуличним мистецтвом і скульптурами, що додає особливого шарму його культурному ландшафту.
            `,
          images: [exampleImg, exampleImg, exampleImg, exampleImg],
        },
      ],
    },
    {
      id: "2",
      name: "Фламська залізниця",
      shortDesc:
        "Одна з наймальовничіших залізниць у світі, що проходить через гори та фіорди.",
      images: [
        {
          url: exampleImg,
          description: "Поїзд на Фламській залізниці.",
        },
        {
          url: "https://example.com/flam2.jpg",
          description: "Вид з вікна поїзда Фламської залізниці.",
        },
      ],
      sections: [
        {
          title: "Історія",
          content: `
              Осло було засноване в 1040 році та стало столицею Норвегії в 1299 році. Місто пройшло через багато випробувань, включаючи кілька значних пожеж, які знищили велику частину середньовічної забудови. Після великої пожежі в 1624 році король Крістіан IV вирішив перебудувати місто під назвою Крістіанія. Тільки в 1925 році місто повернуло своє історичне ім'я Осло. Сьогодні Осло є важливим культурним і економічним центром країни. Завдяки своєму розташуванню на узбережжі фіорду Осло та оточенню лісами, місто пропонує унікальне поєднання природної краси та міського життя. Осло є домом для багатьох історичних пам'яток, таких як замок Акерсгус, який був побудований у 13 столітті, і є одним із найважливіших середньовічних замків у Норвегії. Місто також відіграло ключову роль у розвитку норвезької морської торгівлі та культури.
            `,
          images: [exampleImg, exampleImg, exampleImg],
        },
        {
          title: "Культура",
          content: `
              Осло відоме своїми музеями, театрами та культурними заходами. Місто має багату культурну спадщину, яку можна побачити в численних музеях, таких як Музей Мунка, Національна галерея та Норвезький фольклорний музей. Осло також є домом для Нобелівського центру миру, де щорічно вручається Нобелівська премія миру. У місті проходять різні музичні та театральні фестивалі, включаючи відомий фестиваль музики Осло. Місто пишається своєю живою музичною сценою, де можна почути як класичну, так і сучасну музику. Осло також відоме своїми архітектурними шедеврами, такими як будівля Оперного театру, яка є символом сучасної архітектури. Вулиці міста наповнені вуличним мистецтвом і скульптурами, що додає особливого шарму його культурному ландшафту.
            `,
          images: [exampleImg, exampleImg, exampleImg, exampleImg],
        },
      ],
    },
    {
      id: "3",
      name: "Собор Нідарос",
      shortDesc:
        "Найбільший середньовічний собор у Скандинавії, розташований у Тронгеймі.",
      images: [
        {
          url: exampleImg,
          description: "Собор Нідарос з зовнішньої сторони.",
        },
        {
          url: "https://example.com/nidaros2.jpg",
          description: "Інтер'єр собору Нідарос.",
        },
      ],
      sections: [
        {
          title: "Історія",
          content: `
              Осло було засноване в 1040 році та стало столицею Норвегії в 1299 році. Місто пройшло через багато випробувань, включаючи кілька значних пожеж, які знищили велику частину середньовічної забудови. Після великої пожежі в 1624 році король Крістіан IV вирішив перебудувати місто під назвою Крістіанія. Тільки в 1925 році місто повернуло своє історичне ім'я Осло. Сьогодні Осло є важливим культурним і економічним центром країни. Завдяки своєму розташуванню на узбережжі фіорду Осло та оточенню лісами, місто пропонує унікальне поєднання природної краси та міського життя. Осло є домом для багатьох історичних пам'яток, таких як замок Акерсгус, який був побудований у 13 столітті, і є одним із найважливіших середньовічних замків у Норвегії. Місто також відіграло ключову роль у розвитку норвезької морської торгівлі та культури.
            `,
          images: [exampleImg, exampleImg, exampleImg],
        },
        {
          title: "Культура",
          content: `
              Осло відоме своїми музеями, театрами та культурними заходами. Місто має багату культурну спадщину, яку можна побачити в численних музеях, таких як Музей Мунка, Національна галерея та Норвезький фольклорний музей. Осло також є домом для Нобелівського центру миру, де щорічно вручається Нобелівська премія миру. У місті проходять різні музичні та театральні фестивалі, включаючи відомий фестиваль музики Осло. Місто пишається своєю живою музичною сценою, де можна почути як класичну, так і сучасну музику. Осло також відоме своїми архітектурними шедеврами, такими як будівля Оперного театру, яка є символом сучасної архітектури. Вулиці міста наповнені вуличним мистецтвом і скульптурами, що додає особливого шарму його культурному ландшафту.
            `,
          images: [exampleImg, exampleImg, exampleImg, exampleImg],
        },
      ],
    },
    {
      id: "4",
      name: "Преікестолен",
      shortDesc:
        "Відома скеля, яка виступає над Люсе-фіордом на висоті 604 метри.",
      images: [
        {
          url: exampleImg,
          description: "Вид на Преікестолен зверху.",
        },
        {
          url: "https://example.com/preikestolen2.jpg",
          description: "Туристи на Преікестолен.",
        },
      ],
      sections: [
        {
          title: "Історія",
          content: `
              Осло було засноване в 1040 році та стало столицею Норвегії в 1299 році. Місто пройшло через багато випробувань, включаючи кілька значних пожеж, які знищили велику частину середньовічної забудови. Після великої пожежі в 1624 році король Крістіан IV вирішив перебудувати місто під назвою Крістіанія. Тільки в 1925 році місто повернуло своє історичне ім'я Осло. Сьогодні Осло є важливим культурним і економічним центром країни. Завдяки своєму розташуванню на узбережжі фіорду Осло та оточенню лісами, місто пропонує унікальне поєднання природної краси та міського життя. Осло є домом для багатьох історичних пам'яток, таких як замок Акерсгус, який був побудований у 13 столітті, і є одним із найважливіших середньовічних замків у Норвегії. Місто також відіграло ключову роль у розвитку норвезької морської торгівлі та культури.
            `,
          images: [exampleImg, exampleImg, exampleImg],
        },
        {
          title: "Культура",
          content: `
              Осло відоме своїми музеями, театрами та культурними заходами. Місто має багату культурну спадщину, яку можна побачити в численних музеях, таких як Музей Мунка, Національна галерея та Норвезький фольклорний музей. Осло також є домом для Нобелівського центру миру, де щорічно вручається Нобелівська премія миру. У місті проходять різні музичні та театральні фестивалі, включаючи відомий фестиваль музики Осло. Місто пишається своєю живою музичною сценою, де можна почути як класичну, так і сучасну музику. Осло також відоме своїми архітектурними шедеврами, такими як будівля Оперного театру, яка є символом сучасної архітектури. Вулиці міста наповнені вуличним мистецтвом і скульптурами, що додає особливого шарму його культурному ландшафту.
            `,
          images: [exampleImg, exampleImg, exampleImg, exampleImg],
        },
      ],
    },
    {
      id: "5",
      name: "Вігеландський парк",
      shortDesc:
        "Найбільший парк скульптур у світі, створений одним художником - Густавом Вігеландом.",
      images: [
        {
          url: exampleImg,
          description: "Скульптури в Вігеландському парку.",
        },
        {
          url: "https://example.com/vigeland2.jpg",
          description: "Моноліт в Вігеландському парку.",
        },
      ],
      sections: [
        {
          title: "Історія",
          content: `
              Осло було засноване в 1040 році та стало столицею Норвегії в 1299 році. Місто пройшло через багато випробувань, включаючи кілька значних пожеж, які знищили велику частину середньовічної забудови. Після великої пожежі в 1624 році король Крістіан IV вирішив перебудувати місто під назвою Крістіанія. Тільки в 1925 році місто повернуло своє історичне ім'я Осло. Сьогодні Осло є важливим культурним і економічним центром країни. Завдяки своєму розташуванню на узбережжі фіорду Осло та оточенню лісами, місто пропонує унікальне поєднання природної краси та міського життя. Осло є домом для багатьох історичних пам'яток, таких як замок Акерсгус, який був побудований у 13 столітті, і є одним із найважливіших середньовічних замків у Норвегії. Місто також відіграло ключову роль у розвитку норвезької морської торгівлі та культури.
            `,
          images: [exampleImg, exampleImg, exampleImg],
        },
        {
          title: "Культура",
          content: `
              Осло відоме своїми музеями, театрами та культурними заходами. Місто має багату культурну спадщину, яку можна побачити в численних музеях, таких як Музей Мунка, Національна галерея та Норвезький фольклорний музей. Осло також є домом для Нобелівського центру миру, де щорічно вручається Нобелівська премія миру. У місті проходять різні музичні та театральні фестивалі, включаючи відомий фестиваль музики Осло. Місто пишається своєю живою музичною сценою, де можна почути як класичну, так і сучасну музику. Осло також відоме своїми архітектурними шедеврами, такими як будівля Оперного театру, яка є символом сучасної архітектури. Вулиці міста наповнені вуличним мистецтвом і скульптурами, що додає особливого шарму його культурному ландшафту.
            `,
          images: [exampleImg, exampleImg, exampleImg, exampleImg],
        },
      ],
    },
  ],
};

export const landmarksSlice = createSlice({
  name: "landmarks",
  initialState,
  reducers: {},
});

// export const {} = authSlice.actions;

export const landmarksReducer = landmarksSlice.reducer;
