export const citiesTestArr = [
    {
      title: "Осло",
      subtitle:
        "Осло – столица Норвегии и крупный европейский город, раскинувший свои владения на северной...",
    },
    {
      title: "Берген",
      subtitle:
        "Берген – второй по величине город Норвегии, известный своими живописными фьордами и историческим...",
    },
    {
      title: "Тромсё",
      subtitle:
        "Тромсё – это арктический город Норвегии, популярный среди туристов своими северными сияниями и...",
    },
    {
      title: "Ставангер",
      subtitle:
        "Ставангер – известный нефтяной центр Норвегии, предлагающий великолепные пляжи и исторические достопримечательности...",
    },
    {
      title: "Тронхейм",
      subtitle:
        "Тронхейм – один из старейших городов Норвегии, славящийся своими средневековыми зданиями и красивым...",
    },
  ];