import css from "./Currency.module.css";
import Paragraph from "../../../components/Pragraph/Pragraph";

const Currency = () => {
  return (
    <div className={css.Currency}>
      <Paragraph>
        <strong>Норвезька крона</strong> (NOK) — офіційна валюта Норвегії. Крона
        була введена в обіг у 1875 році, замінивши норвезький спесідалер. Одна
        крона ділиться на 100 ерів, хоча монети номіналом в ери були вилучені з
        обігу в 2012 році.
      </Paragraph>
      <Paragraph>
        Символ норвезької крони — kr, а міжнародний код — NOK. На банкнотах і
        монетах зображені видатні норвежці, історичні події, а також природні та
        культурні символи країни. Наприклад, на банкнотах можна побачити
        зображення Едварда Мунка, відомого художника, та Кіркенес, важливого
        порту на півночі країни.
      </Paragraph>
      <Paragraph>
        Норвезька крона має відносно стабільний курс завдяки сильній економіці
        країни, яка значною мірою залежить від нафтової та газової
        промисловості. Норвегія є однією з небагатьох європейських країн, що не
        входять до Єврозони, і продовжує використовувати свою національну
        валюту.
      </Paragraph>
      <Paragraph>
        Обміняти валюту в Норвегії можна у банках, обмінних пунктах або
        банкоматах. Кредитні та дебетові картки широко приймаються, і багато
        транзакцій в країні здійснюються безготівковим способом. Це робить
        Норвегію зручною для туристів, які можуть користуватися своїми картками
        практично всюди. Важливо зазначити, що ціни в Норвегії одні з найвищих в
        Європі. Проте висока якість життя, стабільна економіка і надійна
        фінансова система компенсують ці витрати. Туристи повинні бути готові до
        високих цін на їжу, транспорт та інші послуги.
      </Paragraph>
    </div>
  );
};

export default Currency;
