import css from "./Capital.module.css";
import Paragraph from "../../../components/Pragraph/Pragraph";

const Capital = () => {
  return (
    <div className={css.Capital}>
      <Paragraph>
        <strong>Осло</strong> (Oslo) — столиця Норвегії та її найбільше місто,
        розташоване на південному сході країни. Це місто вражає своєю
        комбінацією сучасної архітектури, історичних пам'яток та природних
        красот. Осло є культурним і економічним центром Норвегії. Тут
        знаходяться головні державні установи, численні музеї, театри та
        галереї. Одним із найбільш відомих місць є Парк скульптур Вігеланда, де
        розташовано понад 200 скульптур, створених Густавом Вігеландом. Місто
        також відоме своєю пристанню Аккер Брюгге, де можна знайти численні
        ресторани, магазини та місця для відпочинку. Влітку ця зона стає
        особливо популярною серед туристів і місцевих жителів. В Осло
        розташовані деякі з найважливіших музеїв Норвегії, зокрема Музей
        кораблів вікінгів, Норвезький музей історії та Картинна галерея Мунка,
        де зберігається знаменита картина «Крик». Окрім культурних пам'яток,
        Осло оточене природними красотами. Місто знаходиться на березі
        Осло-фіорду, і з багатьох місць відкриваються захоплюючі види на воду та
        навколишні острови. Ліси та парки займають значну частину території
        міста, що робить його привабливим для любителів природи. Осло — місто з
        багатою історією та сучасним духом, що робить його привабливим як для
        туристів, так і для жителів. Це місто вміє поєднувати стародавні
        традиції з новітніми тенденціями, що створює унікальну атмосферу для
        всіх, хто тут опиняється.
      </Paragraph>
      <Paragraph>
        Характер в Осло стриманий і навіть злегка прохолодний, що абсолютно не
        заважає йому щорічно приймати тисячі туристів, які приїжджають сюди
        побродити художніми галереями, оцінити поетичні краєвиди одного з
        найкрасивіших фіордів королівства і випробувати свої спортивні здібності
        на місцевих гірськолижних трасах. Крім того, це одне з небагатьох місць
        у світі, де турбота про навколишнє середовище зведена в культ. Тож
        їздити в Осло заведено ще й для того, щоб надихатися повітрям, не
        зіпсованим промисловими викидами, і переконатися в тому, що звичайна
        вода, що тече з-під крана, цілком здатна не поступатися за чистотою і
        смаковими якостями джерельній.
      </Paragraph>
      <Paragraph>
        Клімат Осло має типово скандинавський характер, зумовлений близькістю
        Північного моря. Літо тут недовге і дуже скупе на погожі сонячні дні,
        через що середня температурна позначка липня вкрай рідко перевищує +17
        °С. Зате в зимові місяці місцеві жителі практично не стикаються з таким
        поняттям, як холоднеча, оскільки середня температура для норвезького
        січня - це смішні, за російськими мірками, -3 °С. Осінь в Осло приходить
        рано, а йде з нього вкрай неохоче, на кілька місяців накриваючи місто
        сірим небом і нескінченною низкою мрячних дощів.
      </Paragraph>
    </div>
  );
};

export default Capital;
