import css from "./Country.module.css";
import Paragraph from "../../../components/Pragraph/Pragraph";
import ImgSet from "../../../components/ImgSet/ImgSet";
// Імпортуйте зображення
import img1 from "../../../images/mainPageCity/01.jpg";
import img2 from "../../../images/mainPageCity/02.jpg";
import img3 from "../../../images/mainPageCity/03.jpg";

const Country = () => {
  return (
    <div className={css.Country}>
      <Paragraph>
        <strong>Норвегія</strong> (Norway) — країна контрастів і гострих
        відчуттів. Тут величні гори нависають над таємничими фіордами; сувору
        зиму нерідко змінює розкішне літо; а довгі полярні ночі поступаються
        місцем білим ночам. Ця країна дасть змогу мандрівникові скуштувати і
        традиційного укладу життя, і благ сучасної цивілізації, і природних
        красот, і міських задоволень.
      </Paragraph>
      <Paragraph>
        Норвегія, відома переважно своїми природними красотами, багата ще
        історією та культурним життям. Влітку тут відбувається багато подій,
        пов'язаних із природою та культурою, включно зі святами та концертами
        просто неба серед мальовничих місць. Зима пропонує свої розваги, від лиж
        та інших спортивних забав до різдвяних ярмарків і такого видовища, як
        північне сяйво.
      </Paragraph>
      <ImgSet
        imgArr={[
          { src: img1, alt: "???" },
          { src: img2, alt: "???" },
          { src: img3, alt: "???" },
        ]}
      />
      <Paragraph>
        Норвегія - найпівнічніша європейська країна - розташована на північному
        заході Скандинавського півострова і межує на сході зі Швецією, на
        півночі - з Фінляндією та Росією; на півдні та заході її омиває Північне
        море й Атлантичний океан, а на півночі - Льодовитий океан і Баренцове
        море. Займаючи площу 385 252 км² і простягнувшись з півдня на північ від
        57 до 72° північної широти, Норвегія є однією з найбільших країн Європи
        з населенням лише в 4,8 млн осіб, тобто з щільністю 12 осіб на 1 км².
        Найпівнічніша точка європейського континенту розташована в Норвегії, де
        одна третина території лежить за полярним колом, включно з островами
        Ян-Майєн, Свальбард і Ведмежий.
      </Paragraph>
      <Paragraph>
        Значну частину Норвегії займають гірські хребти або нагір'я на кшталт
        Хардангервідда, найбільшого в Європі, площею 11 900 км². Берегову лінію
        складають переважно фіорди, острови, острівці та шхери, тоді як на
        кордоні зі Швецією тягнуться ліси та озера. Оброблювана земля займає
        лише 3% всієї площі, тож багатьом норвежцям здавна доводилося поєднувати
        землеробство з рибальством, аби звести кінці з кінцями і вижити в
        суворих умовах.
      </Paragraph>
      <Paragraph>
        Море не тільки фізично сформувало тутешню землю, а й створило норвезьку
        державу, стародавню і теперішню, звівши воєдино мореплавців-вікінгів,
        торгівлю рибою і рибними виробами та видобуток відносно нещодавно
        відкритої (кінець 1960-х років) у Північному морі нафти. Норвегія досі
        залишається одним із найбільших у світі постачальників риби та
        морепродуктів
      </Paragraph>
    </div>
  );
};

export default Country;
